#### Terraform Format and Style 🖌`success`
#### hca-prod - Terraform Initialization ⚙️`success`
#### hca-prod - Terraform Validation 🤖Success! The configuration is valid.


#### hca-prod - Terraform Plan 📖`success`

<details><summary>hca-prod - Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.cloudsql.random_id.cloudsql_random_id: Refreshing state... [id=kMqWvQXHtbM]
module.cloudsql.random_id.db_password["argo"]: Refreshing state... [id=3K99sIJrlP3iLczM0uNFIQ]
data.google_dns_managed_zone.prod_zone: Refreshing state...
google_storage_bucket.ucsc_bucket: Refreshing state... [id=broad-dsp-monster-hca-prod-ucsc-storage]
module.hca_gke_runner_account.google_service_account.sa: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/hca-gke-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_dataflow_account.google_service_account.sa: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket.temp_bucket: Refreshing state... [id=broad-dsp-monster-hca-prod-temp-storage]
module.enable_services.google_project_service.cloud_resource_manager: Refreshing state... [id=mystical-slate-284720/cloudresourcemanager.googleapis.com]
module.ebi_writer_account.google_service_account.sa: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/ebi-staging-writer@mystical-slate-284720.iam.gserviceaccount.com]
module.enable_services.google_project_service.service_usage: Refreshing state... [id=mystical-slate-284720/serviceusage.googleapis.com]
module.master.data.google_project.project: Refreshing state...
data.google_project.current_project: Refreshing state...
module.hca_argo_runner_account.google_service_account.sa: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket.ebi_bucket: Refreshing state... [id=broad-dsp-monster-hca-prod-ebi-storage]
google_storage_bucket.staging_storage: Refreshing state... [id=broad-dsp-monster-hca-prod-staging-storage]
google_storage_bucket.hca_argo_archive: Refreshing state... [id=broad-dsp-monster-hca-prod-argo-archive]
data.google_storage_transfer_project_service_account.sts_account: Refreshing state...
google_storage_bucket_iam_member.ucsc_bucket_iam["hannes@ucsc.edu"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ucsc-storage/roles/storage.admin/user:hannes@ucsc.edu]
google_storage_bucket_iam_member.ucsc_bucket_iam["dsotirho@ucsc.edu"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ucsc-storage/roles/storage.admin/user:dsotirho@ucsc.edu]
module.ebi_writer_account.null_resource.sa_delay: Refreshing state... [id=6143318435796113693]
module.ebi_writer_account.google_service_account_key.sa_key: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/ebi-staging-writer@mystical-slate-284720.iam.gserviceaccount.com/keys/0db8722776c06e977694b69f4bbba508dd92b517]
module.hca_gke_runner_account.null_resource.sa_delay: Refreshing state... [id=5830129711160933720]
module.hca_dataflow_account.null_resource.sa_delay: Refreshing state... [id=4570224320786554972]
module.hca_gke_runner_account.google_service_account_key.sa_key: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/hca-gke-runner@mystical-slate-284720.iam.gserviceaccount.com/keys/a6e4aacbd0cf5df872b1bdcb444a80b358479824]
module.hca_dataflow_account.google_service_account_key.sa_key: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com/keys/09b6bc02c5819434293efe5fdb8340883b6b2feb]
module.hca_argo_runner_account.null_resource.sa_delay: Refreshing state... [id=3345864264350360758]
module.hca_argo_runner_account.google_service_account_key.sa_key: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com/keys/d4facd05d8caeeaa15e8d3a946a5afe5d044fdac]
google_storage_bucket_iam_member.ebi_sa_bucket_iam["ebi-staging-writer@broad-dsp-monster-hca-dev.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.admin/serviceaccount:ebi-staging-writer@broad-dsp-monster-hca-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.ebi_bucket_iam["rolando@ebi.ac.uk"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.admin/user:rolando@ebi.ac.uk]
google_storage_bucket_iam_member.ebi_bucket_iam["enrique@ebi.ac.uk"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.admin/user:enrique@ebi.ac.uk]
module.ebi_writer_account.google_project_iam_member.sa_iam["storagetransfer.user"]: Refreshing state... [id=mystical-slate-284720/roles/storagetransfer.user/serviceaccount:ebi-staging-writer@mystical-slate-284720.iam.gserviceaccount.com]
module.ebi_writer_account.google_project_iam_member.sa_iam["storagetransfer.viewer"]: Refreshing state... [id=mystical-slate-284720/roles/storagetransfer.viewer/serviceaccount:ebi-staging-writer@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket_iam_member.ebi_writer_iam: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.objectAdmin/serviceaccount:ebi-staging-writer@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket_iam_member.staging_account_iam_reader: Refreshing state... [id=b/broad-dsp-monster-hca-prod-staging-storage/roles/storage.objectViewer/serviceaccount:terra-data-repository@broad-datarepo-terra-prod.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_ebi_reader_iam["hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.objectViewer/serviceaccount:hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_ebi_reader_iam["jade-k8-sa@broad-jade-dev.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.objectViewer/serviceaccount:jade-k8-sa@broad-jade-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_ebi_reader_iam["terra-data-repository@broad-datarepo-terra-prod.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.objectViewer/serviceaccount:terra-data-repository@broad-datarepo-terra-prod.iam.gserviceaccount.com]
module.hca_gke_runner_account.google_project_iam_member.sa_iam["logging.logWriter"]: Refreshing state... [id=mystical-slate-284720/roles/logging.logWriter/serviceaccount:hca-gke-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_gke_runner_account.google_project_iam_member.sa_iam["monitoring.metricWriter"]: Refreshing state... [id=mystical-slate-284720/roles/monitoring.metricWriter/serviceaccount:hca-gke-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_gke_runner_account.google_project_iam_member.sa_iam["monitoring.viewer"]: Refreshing state... [id=mystical-slate-284720/roles/monitoring.viewer/serviceaccount:hca-gke-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_ucsc_reader_iam["jade-k8-sa@broad-jade-dev.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ucsc-storage/roles/storage.objectViewer/serviceaccount:jade-k8-sa@broad-jade-dev.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_ucsc_reader_iam["hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ucsc-storage/roles/storage.objectViewer/serviceaccount:hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket_iam_member.tdr_ucsc_reader_iam["terra-data-repository@broad-datarepo-terra-prod.iam.gserviceaccount.com"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ucsc-storage/roles/storage.objectViewer/serviceaccount:terra-data-repository@broad-datarepo-terra-prod.iam.gserviceaccount.com]
module.hca_dataflow_account.google_project_iam_member.sa_iam["dataflow.worker"]: Refreshing state... [id=mystical-slate-284720/roles/dataflow.worker/serviceaccount:hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_argo_runner_account.google_project_iam_member.sa_iam["dataflow.developer"]: Refreshing state... [id=mystical-slate-284720/roles/dataflow.developer/serviceaccount:hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_argo_runner_account.google_project_iam_member.sa_iam["bigquery.dataOwner"]: Refreshing state... [id=mystical-slate-284720/roles/bigquery.dataOwner/serviceaccount:hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_argo_runner_account.google_project_iam_member.sa_iam["bigquery.jobUser"]: Refreshing state... [id=mystical-slate-284720/roles/bigquery.jobUser/serviceaccount:hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_argo_runner_account.google_project_iam_member.sa_iam["compute.viewer"]: Refreshing state... [id=mystical-slate-284720/roles/compute.viewer/serviceaccount:hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_service_account_iam_binding.dataflow_runner_user_binding: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com/roles/iam.serviceAccountUser]
google_storage_bucket_iam_member.hca_argo_logs_bucket_iam: Refreshing state... [id=b/broad-dsp-monster-hca-prod-argo-archive/roles/storage.admin/serviceaccount:hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket_iam_member.hca_argo_staging_bucket_iam: Refreshing state... [id=b/broad-dsp-monster-hca-prod-staging-storage/roles/storage.admin/serviceaccount:hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket_iam_member.hca_argo_temp_bucket_iam: Refreshing state... [id=b/broad-dsp-monster-hca-prod-temp-storage/roles/storage.admin/serviceaccount:hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.hca_gke_runner_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/prod/ingest/hca/service-accounts/gke-runner]
module.cloudsql.vault_generic_secret.postgres_user["argo"]: Refreshing state... [id=secret/dsde/monster/prod/ingest/hca/cloudsql/users/argo]
module.ebi_writer_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/prod/ingest/hca/service-accounts/ebi-storage-writer]
module.hca_dataflow_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/prod/ingest/hca/service-accounts/hca-dataflow-runner]
module.hca_argo_runner_account.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/prod/ingest/hca/service-accounts/hca-argo-runner]
google_storage_bucket_iam_member.sts_iam["storage.legacyBucketWriter"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.legacyBucketWriter/serviceaccount:project-612961917858@storage-transfer-service.iam.gserviceaccount.com]
google_storage_bucket_iam_member.sts_iam["storage.legacyBucketReader"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.legacyBucketReader/serviceaccount:project-612961917858@storage-transfer-service.iam.gserviceaccount.com]
google_storage_bucket_iam_member.sts_iam["storage.objectViewer"]: Refreshing state... [id=b/broad-dsp-monster-hca-prod-ebi-storage/roles/storage.objectViewer/serviceaccount:project-612961917858@storage-transfer-service.iam.gserviceaccount.com]
google_storage_bucket_iam_member.staging_bucket_runner_iam: Refreshing state... [id=b/broad-dsp-monster-hca-prod-staging-storage/roles/storage.admin/serviceaccount:hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_storage_bucket_iam_member.temp_bucket_runner_iam: Refreshing state... [id=b/broad-dsp-monster-hca-prod-temp-storage/roles/storage.admin/serviceaccount:hca-dataflow-runner@mystical-slate-284720.iam.gserviceaccount.com]
google_service_account_iam_binding.hca_workload_identity_binding: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/hca-argo-runner@mystical-slate-284720.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.enable_services.google_project_service.services[9]: Refreshing state... [id=mystical-slate-284720/replicapoolupdater.googleapis.com]
module.enable_services.google_project_service.services[16]: Refreshing state... [id=mystical-slate-284720/storage-component.googleapis.com]
module.enable_services.google_project_service.services[10]: Refreshing state... [id=mystical-slate-284720/resourceviews.googleapis.com]
module.enable_services.google_project_service.services[6]: Refreshing state... [id=mystical-slate-284720/logging.googleapis.com]
module.enable_services.google_project_service.services[2]: Refreshing state... [id=mystical-slate-284720/containerregistry.googleapis.com]
module.enable_services.google_project_service.services[8]: Refreshing state... [id=mystical-slate-284720/replicapool.googleapis.com]
module.enable_services.google_project_service.services[5]: Refreshing state... [id=mystical-slate-284720/iamcredentials.googleapis.com]
module.enable_services.google_project_service.services[1]: Refreshing state... [id=mystical-slate-284720/container.googleapis.com]
module.enable_services.google_project_service.services[7]: Refreshing state... [id=mystical-slate-284720/monitoring.googleapis.com]
module.enable_services.google_project_service.services[18]: Refreshing state... [id=mystical-slate-284720/storagetransfer.googleapis.com]
module.enable_services.google_project_service.services[0]: Refreshing state... [id=mystical-slate-284720/compute.googleapis.com]
module.enable_services.google_project_service.services[14]: Refreshing state... [id=mystical-slate-284720/stackdriver.googleapis.com]
module.enable_services.google_project_service.services[3]: Refreshing state... [id=mystical-slate-284720/dns.googleapis.com]
module.enable_services.google_project_service.services[15]: Refreshing state... [id=mystical-slate-284720/storage-api.googleapis.com]
module.enable_services.google_project_service.services[12]: Refreshing state... [id=mystical-slate-284720/sqladmin.googleapis.com]
module.enable_services.google_project_service.services[17]: Refreshing state... [id=mystical-slate-284720/dataflow.googleapis.com]
module.enable_services.google_project_service.services[4]: Refreshing state... [id=mystical-slate-284720/iam.googleapis.com]
module.enable_services.google_project_service.services[13]: Refreshing state... [id=mystical-slate-284720/sql-component.googleapis.com]
module.enable_services.google_project_service.services[11]: Refreshing state... [id=mystical-slate-284720/runtimeconfig.googleapis.com]
module.k8s_network.google_compute_network.network: Refreshing state... [id=projects/mystical-slate-284720/global/networks/hca-network]
module.k8s_network.google_compute_address.nat_addresses[0]: Refreshing state... [id=projects/mystical-slate-284720/regions/us-central1/addresses/hca-network-nat-0]
module.k8s_network.google_compute_address.nat_addresses[1]: Refreshing state... [id=projects/mystical-slate-284720/regions/us-central1/addresses/hca-network-nat-1]
module.cloudsql.module.proxy_sa.google_service_account.sa: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/command-center-proxy-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.cloudsql.google_sql_database_instance.postgres: Refreshing state... [id=command-center-postgres-90ca96bd05c7b5b3]
module.dns_names.google_compute_global_address.global_ip_address["hca-grafana"]: Refreshing state... [id=projects/mystical-slate-284720/global/addresses/hca-grafana-ip]
module.dns_names.google_compute_global_address.global_ip_address["hca-argo"]: Refreshing state... [id=projects/mystical-slate-284720/global/addresses/hca-argo-ip]
module.cloudsql.google_sql_user.db_user["argo"]: Refreshing state... [id=argo//command-center-postgres-90ca96bd05c7b5b3]
module.cloudsql.vault_generic_secret.postgres_connection_name: Refreshing state... [id=secret/dsde/monster/prod/ingest/hca/cloudsql/instance]
module.cloudsql.module.proxy_sa.null_resource.sa_delay: Refreshing state... [id=3815916769449075674]
module.cloudsql.module.proxy_sa.google_service_account_key.sa_key: Refreshing state... [id=projects/mystical-slate-284720/serviceAccounts/command-center-proxy-runner@mystical-slate-284720.iam.gserviceaccount.com/keys/cbdfe0b54105601688b21a47b76fe28cd826bab9]
module.cloudsql.module.proxy_sa.google_project_iam_member.sa_iam["cloudsql.client"]: Refreshing state... [id=mystical-slate-284720/roles/cloudsql.client/serviceaccount:command-center-proxy-runner@mystical-slate-284720.iam.gserviceaccount.com]
module.k8s_network.google_compute_router.router: Refreshing state... [id=projects/mystical-slate-284720/regions/us-central1/routers/hca-network-router]
module.k8s_network.google_compute_subnetwork.subnetworks[0]: Refreshing state... [id=projects/mystical-slate-284720/regions/us-central1/subnetworks/hca-network]
module.dns_names.google_dns_record_set.a_dns["hca-argo"]: Refreshing state... [id=monster-prod/hca-argo-global.monster-prod.broadinstitute.org./A]
module.cloudsql.module.proxy_sa.vault_generic_secret.sa_secret: Refreshing state... [id=secret/dsde/monster/prod/ingest/hca/service-accounts/command-center-proxy-runner]
module.dns_names.google_dns_record_set.a_dns["hca-grafana"]: Refreshing state... [id=monster-prod/hca-grafana-global.monster-prod.broadinstitute.org./A]
module.dns_names.google_dns_record_set.cname_dns["hca-grafana"]: Refreshing state... [id=monster-prod/hca-grafana.monster-prod.broadinstitute.org./CNAME]
module.dns_names.google_dns_record_set.cname_dns["hca-argo"]: Refreshing state... [id=monster-prod/hca-argo.monster-prod.broadinstitute.org./CNAME]
module.k8s_network.google_compute_router_nat.nat: Refreshing state... [id=mystical-slate-284720/us-central1/hca-network-router/hca-network-nat]
module.master.google_container_cluster.master: Refreshing state... [id=projects/mystical-slate-284720/locations/us-central1-c/clusters/hca-cluster]
module.master.vault_generic_secret.master_secrets: Refreshing state... [id=secret/dsde/monster/prod/ingest/hca/gke]
module.node_pool.google_container_node_pool.pool: Refreshing state... [id=projects/mystical-slate-284720/locations/us-central1-c/clusters/hca-cluster/nodePools/hca-node-pool]
module.cloudsql.google_sql_database.db["argo"]: Refreshing state... [id=projects/mystical-slate-284720/instances/command-center-postgres-90ca96bd05c7b5b3/databases/argo]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cloudsql.google_sql_database_instance.postgres will be updated in-place
  ~ resource "google_sql_database_instance" "postgres" {
        connection_name               = "mystical-slate-284720:us-central1:command-center-postgres-90ca96bd05c7b5b3"
        database_version              = "POSTGRES_9_6"
      + deletion_protection           = true
        first_ip_address              = "35.184.123.207"
        id                            = "command-center-postgres-90ca96bd05c7b5b3"
        ip_address                    = [
            {
                ip_address     = "35.184.123.207"
                time_to_retire = ""
                type           = "PRIMARY"
            },
        ]
        name                          = "command-center-postgres-90ca96bd05c7b5b3"
        project                       = "mystical-slate-284720"
        public_ip_address             = "35.184.123.207"
        region                        = "us-central1"
        self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/mystical-slate-284720/instances/command-center-postgres-90ca96bd05c7b5b3"
        server_ca_cert                = [
            {
                cert             = <<~EOT
                    -----BEGIN CERTIFICATE-----
                    MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQ5NDNm
                    NDNhMC05NWQ2LTQwZWUtOGE5ZC02MDNhZDAxYTIyYjAxIzAhBgNVBAMTGkdvb2ds
                    ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
                    A1UEBhMCVVMwHhcNMjAwNzI5MTkyNjM0WhcNMzAwNzI3MTkyNzM0WjB3MS0wKwYD
                    VQQuEyQ5NDNmNDNhMC05NWQ2LTQwZWUtOGE5ZC02MDNhZDAxYTIyYjAxIzAhBgNV
                    BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
                    IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
                    AQC7y4ipr8xawRFltFXUpKibW9puYeEr9NAo73F+Xa1UuOGiySUQr8eG/Ges8SPe
                    dM7/LuHUVjwUEnDEsAQ/OJNogQ6WIhpzKpdC7dqmMrv/6Y7IlDl0r0ljlCbHVkG2
                    D+Ca7MvA3C0BFyIOS2nfcL7UdyIg9tMv2lw56OSwKdTmT7jaWxYopYWF/oA/9IYb
                    is+nGgWP2JzCPD5AYvMjVgM5e03qv+Q6cgTfzU8Bxr3sbvb72MXapA9L9aDWFCGM
                    VwmflU2sc1mz9TuQlTBB+4YpehbgeNDH8RNUdyfhoNMWIB0iZ2KDsOPfoq5xCD41
                    0s2L9Pi/NcEF3VeR00SGXPndAgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
                    DQYJKoZIhvcNAQELBQADggEBACD77IMg8B7POdkz8h2f8xNzlYP2K1eNDvXcQNyi
                    tmMLi6nrZUzMHxcW3FmTZmv8PWWLBTZW5rgNN+qBDVi7BXYvHwLfyP+ttPqN+WYw
                    917lRAjNWlDAgYsWOZdG8gbVU3A8JyoEC182mUngVtT6gt6yrxVCyQTRS0tTzJLV
                    /+8O+vDrYIH8ItQqPhOpVMFGpgjmqHTijXacjQcX3iBdc6VkX6ABcIPQT3fMqk7S
                    MVoYQVO5M7xe8OWd1D6hkLjc+FnxJwXgXHEsY0flpGiwDkdRq94N7mKWEkY6+MN8
                    ZnoTA2ooimXOEN8D4TXe3A8QgdO2tDdYgN2qF3iI3ugeQ8Y=
                    -----END CERTIFICATE-----
                EOT
                common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=943f43a0-95d6-40ee-8a9d-603ad01a22b0"
                create_time      = "2020-07-29T19:26:34.675Z"
                expiration_time  = "2030-07-27T19:27:34.675Z"
                sha1_fingerprint = "9a66bbe06bdaabce55b749ff663e8acdd9436df6"
            },
        ]
        service_account_email_address = "p612961917858-872ss5@gcp-sa-cloud-sql.iam.gserviceaccount.com"

        settings {
            activation_policy           = "ALWAYS"
            authorized_gae_applications = []
            crash_safe_replication      = false
            disk_autoresize             = true
            disk_size                   = 10
            disk_type                   = "PD_SSD"
            pricing_plan                = "PER_USE"
            replication_type            = "SYNCHRONOUS"
            tier                        = "db-custom-4-15360"
            user_labels                 = {
                "app"   = "hca"
                "role"  = "database"
                "state" = "active"
            }
            version                     = 25

            backup_configuration {
                binary_log_enabled             = false
                enabled                        = true
                point_in_time_recovery_enabled = false
                start_time                     = "06:00"
            }

            ip_configuration {
                ipv4_enabled = true
                require_ssl  = true

                authorized_networks {
                    name  = "Broad"
                    value = "69.173.64.0/18"
                }
            }

            location_preference {
                zone = "us-central1-a"
            }
        }
    }

  # module.k8s_network.google_compute_subnetwork.subnetworks[0] will be updated in-place
  ~ resource "google_compute_subnetwork" "subnetworks" {
        creation_timestamp         = "2020-07-29T12:27:08.307-07:00"
        gateway_address            = "10.0.0.1"
        id                         = "projects/mystical-slate-284720/regions/us-central1/subnetworks/hca-network"
        ip_cidr_range              = "10.0.0.0/22"
        name                       = "hca-network"
        network                    = "https://www.googleapis.com/compute/v1/projects/mystical-slate-284720/global/networks/hca-network"
        private_ip_google_access   = true
        private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS"
        project                    = "mystical-slate-284720"
        purpose                    = "PRIVATE"
        region                     = "us-central1"
        secondary_ip_range         = [
            {
                ip_cidr_range = "10.36.0.0/14"
                range_name    = "gke-hca-cluster-pods-6662c939"
            },
            {
                ip_cidr_range = "10.100.0.0/20"
                range_name    = "gke-hca-cluster-services-6662c939"
            },
        ]
        self_link                  = "https://www.googleapis.com/compute/v1/projects/mystical-slate-284720/regions/us-central1/subnetworks/hca-network"

      ~ log_config {
            aggregation_interval = "INTERVAL_10_MIN"
          + filter_expr          = "true"
            flow_sampling        = 0.5
            metadata             = "INCLUDE_ALL_METADATA"
            metadata_fields      = []
        }
    }

  # module.node_pool.google_container_node_pool.pool must be replaced
-/+ resource "google_container_node_pool" "pool" {
        cluster             = "hca-cluster"
      ~ id                  = "projects/mystical-slate-284720/locations/us-central1-c/clusters/hca-cluster/nodePools/hca-node-pool" -> (known after apply)
      ~ initial_node_count  = 3 -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/mystical-slate-284720/zones/us-central1-c/instanceGroupManagers/gke-hca-cluster-hca-node-pool-995627dd-grp",
        ] -> (known after apply)
        location            = "us-central1-c"
      ~ max_pods_per_node   = 110 -> (known after apply)
        name                = "hca-node-pool"
      + name_prefix         = (known after apply)
        node_count          = 3
      ~ node_locations      = [
          - "us-central1-c",
        ] -> (known after apply)
      ~ project             = "mystical-slate-284720" -> (known after apply)
      ~ version             = "1.17.12-gke.1504" -> (known after apply)

        management {
            auto_repair  = true
            auto_upgrade = true
        }

      ~ node_config {
            disk_size_gb      = 30
          ~ disk_type         = "pd-standard" -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
            image_type        = "COS"
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "n1-standard-2" -> "n1-standard-4" # forces replacement
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
            oauth_scopes      = [
                "https://www.googleapis.com/auth/compute",
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
            ]
            preemptible       = false
            service_account   = "hca-gke-runner@mystical-slate-284720.iam.gserviceaccount.com"
          - tags              = [] -> null
          ~ taint             = [] -> (known after apply)

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }

            workload_metadata_config {
                node_metadata = "GKE_METADATA_SERVER"
            }
        }

        upgrade_settings {
            max_surge       = 1
            max_unavailable = 0
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @ThePletch, Action: `pull_request`, Working Directory: `/home/runner/work/monster-deploy/monster-deploy/environments/hca-prod/terraform`, Workflow: `Terraform Plan`*